In [5]:
import pandas as pd
import numpy as np

In [6]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

print(s1, s2, s3)

0     1
1     3
2     3
3     1
4     2
     ..
95    2
96    2
97    4
98    1
99    4
Length: 100, dtype: int64 0     1
1     3
2     2
3     3
4     3
     ..
95    1
96    2
97    1
98    2
99    3
Length: 100, dtype: int64 0     18794
1     19903
2     27517
3     13516
4     24458
      ...
95    13667
96    14224
97    10780
98    27686
99    26174
Length: 100, dtype: int64

## create a DataFrame by joinning the Series by column

In [8]:
df = pd.concat([s1,s2,s3], axis=1)
df.head()

   0  1      2
0  1  1  18794
1  3  3  19903
2  3  2  27517
3  1  3  13516
4  2  3  24458

## Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [11]:
df.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_per_meter'},inplace=True)

In [12]:
df.head()

   bedrs  bathrs  price_per_meter
0      1       1            18794
1      3       3            19903
2      3       2            27517
3      1       3            13516
4      2       3            24458

In [13]:
df2 = pd.DataFrame(df)

In [18]:
type(df2)

pandas.core.frame.DataFrame